Documents/ПротоколИспытаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПротоколИспытаний</Name>
			<BasedOn>
				<xr:Item>Document.Списание</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОИсследованиях</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОтбораПроб</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Списание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИспытания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТНПА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтбораПроб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПартии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемВыборки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктОтбораПроб</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведенияИспытаний</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТНПА2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБракованныхУЕ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вывод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытанияПроизвел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал3</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал3</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал4</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал4</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал5</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал5</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал6</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал6</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал71</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал71</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал72</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал72</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал8</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал8</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал9</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал9</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал91</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал91</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал10</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал10</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРозлива</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсловияПроведенияИспытаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоказателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УсловияИспытаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНачалеИспытания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКонцеИспытания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СведенияОИОиСИ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеИОиСИ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОборудованиеЛаборатории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДействительныеОбъемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МассаБрутто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МассаПустойУпаковки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МассаПродукта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействительныйОбъем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрограммаПроведенияИспытаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеОбъектаИспытаний</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТНПА</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормированноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическиеПоказатели</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводОСоответствии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Соответствие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПротоколИспытаний/Ext/ManagerModule.bsl
Процедура ПротоколИспытаний(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПротоколИспытаний)
	Макет = Документы.ПротоколИспытаний.ПолучитьМакет("ПротоколИспытаний");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПротоколИспытаний.АктОтбораПроб КАК АктОтбораПроб,
	|	ПротоколИспытаний.ВидКонтроля КАК ВидКонтроля,
	|	ПротоколИспытаний.ВидУпаковки КАК ВидУпаковки,
	|	ПротоколИспытаний.Вывод КАК Вывод,
	|	ПротоколИспытаний.Дата КАК Дата,
	|	ПротоколИспытаний.ДатаПроведенияИспытаний КАК ДатаПроведенияИспытаний,
	|	ПротоколИспытаний.ДокументОтбораПроб КАК ДокументОтбораПроб,
	|	ПротоколИспытаний.ИспытанияПроизвел КАК ИспытанияПроизвел,
	|	ПротоколИспытаний.КоличествоБракованныхУЕ КАК КоличествоБракованныхУЕ,
	|	ПротоколИспытаний.МестоОтбораПроб КАК МестоОтбораПроб,
	|	ПротоколИспытаний.Номер КАК Номер,
	|	ПротоколИспытаний.ОбъектИспытания КАК ОбъектИспытания,
	|	ПротоколИспытаний.ОбъемВыборки КАК ОбъемВыборки,
	|	ПротоколИспытаний.РазмерПартии КАК РазмерПартии,
	|	ПротоколИспытаний.ТНПА КАК ТНПА,
	|	ПротоколИспытаний.ТНПА2 КАК ТНПА2,
	|	ПротоколИспытаний.УсловияПроведенияИспытаний.(
	|		НаименованиеПоказателя КАК НаименованиеПоказателя,
	|		ВНачалеИспытания КАК ВНачалеИспытания,
	|		ВКонцеИспытания КАК ВКонцеИспытания
	|	) КАК УсловияПроведенияИспытаний,
	|	ПротоколИспытаний.СведенияОИОиСИ.(
	|		НаименованиеИОиСИ КАК НаименованиеИОиСИ,
	|		НаименованиеИОиСИ.ЗаводскойНомер КАК НаименованиеИОиСИЗаводскойНомер,
	|		НаименованиеИОиСИ.ДатаПроверки КАК НаименованиеИОиСИДатаПроверки,
	|		НаименованиеИОиСИ.СледующаяПроверка КАК НаименованиеИОиСИСледующаяПроверка
	|	) КАК СведенияОИОиСИ,
	|	НаименованиеОрганизации.Значение КАК НаименованиеОрганизации,
	|	Руководитель.Значение.Должность.Наименование КАК ДолжностьРуководителя,
	|	Руководитель.Значение.ФамилияИнициалы КАК РуководительФамилияИнициалы,
	|	ПротоколИспытаний.НомерПартии КАК НомерПартии,
	|	ПротоколИспытаний.ОбъектИспытания.ЕдиницыИзмерения.Наименование КАК ОбъектИспытанияЕдиницыИзмеренияНаименование,
	|	ПротоколИспытаний.ДатаРозлива КАК ДатаРозлива,
	|	ПротоколИспытаний.ДатаИзготовления КАК ДатаИзготовления
	|ИЗ
	|	Документ.ПротоколИспытаний КАК ПротоколИспытаний,
	|	Константа.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	Константа.Руководитель КАК Руководитель
	|ГДЕ
	|	ПротоколИспытаний.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУсловияПроведенияИспытанийШапка = Макет.ПолучитьОбласть("УсловияПроведенияИспытанийШапка");
	ОбластьУсловияПроведенияИспытаний = Макет.ПолучитьОбласть("УсловияПроведенияИспытаний");
	ОбластьСведенияОИОиСИШапка = Макет.ПолучитьОбласть("СведенияОИОиСИШапка");
	ОбластьСведенияОИОиСИ = Макет.ПолучитьОбласть("СведенияОИОиСИ");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.ДатаДокумента = Формат(Выборка.Дата, "ДЛФ=DD");
		Шапка.Параметры.ДатаПроведенияИспытаний = Формат(Выборка.ДатаПроведенияИспытаний, "ДФ=dd.MM.yyyy");
		СведенияОПродукции = Выборка.ОбъектИспытания.Наименование + " партия " + Выборка.НомерПартии + ", дата изготовления:" + Формат(Выборка.ДатаИзготовления, "ДФ=dd.MM.yy") +"г.";
		Если Выборка.ДатаРозлива <> '00010101000000' Тогда
			СведенияОПродукции = СведенияОПродукции +" дата розлива:" + Формат(Выборка.ДатаРозлива, "ДФ=dd.MM.yy") +"г."
		КонецЕсли;
		Шапка.Параметры.СведенияОПродукции = СведенияОПродукции;
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьУсловияПроведенияИспытанийШапка);
		ВыборкаУсловияПроведенияИспытаний = Выборка.УсловияПроведенияИспытаний.Выбрать();
		Пока ВыборкаУсловияПроведенияИспытаний.Следующий() Цикл
			ОбластьУсловияПроведенияИспытаний.Параметры.Заполнить(ВыборкаУсловияПроведенияИспытаний);
			ТабДок.Вывести(ОбластьУсловияПроведенияИспытаний, ВыборкаУсловияПроведенияИспытаний.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьСведенияОИОиСИШапка);
		ВыборкаСведенияОИОиСИ = Выборка.СведенияОИОиСИ.Выбрать();
		Пока ВыборкаСведенияОИОиСИ.Следующий() Цикл
			ОбластьСведенияОИОиСИ.Параметры.Заполнить(ВыборкаСведенияОИОиСИ);
			ОбластьСведенияОИОиСИ.Параметры.НаименованиеИОиСИДатаПроверки = Формат(ВыборкаСведенияОИОиСИ.НаименованиеИОиСИДатаПроверки, "ДФ=dd.MM.yyyy");
			ОбластьСведенияОИОиСИ.Параметры.НаименованиеИОиСИСледующаяПроверка = Формат(ВыборкаСведенияОИОиСИ.НаименованиеИОиСИСледующаяПроверка, "ДФ=dd.MM.yyyy");
			ТабДок.Вывести(ОбластьСведенияОИОиСИ, ВыборкаСведенияОИОиСИ.Уровень());
		КонецЦикла;
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
		
		
		
		
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
